# Pandas

## importing pandas library

In [6]:
import pandas as pd

## Basic Series creation

In [8]:
series = pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [9]:
series = pd.Series((1,2,3,4,5),index=['A','B','C','D','E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

## Set is unordered collection so not possible

In [10]:
series = pd.Series({1,2,3,4,5},index=['A','B','C','D','E'])
series

TypeError: 'set' type is unordered

In [11]:
series = pd.Series({'A':1,'B':2,'C':3,'D':4,'E':5})
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [12]:
pd.Series({"Name":['AA','BB'],"Name1":['AA']})

Name     [AA, BB]
Name1        [AA]
dtype: object

## DataFrame Creation:-

## Syntax:-
## pd.DataFrame(dict)

In [13]:
data = pd.DataFrame({'Name':['Batman','Captain America'],'Role':['Leader','Captain']})
data

              Name     Role
0           Batman   Leader
1  Captain America  Captain

In [14]:
data = pd.DataFrame({'Name':['David Warner','Kane Williamson','Yuvaraj Singh','Shikwar Dhawan',
                             'Aiden Markaram','Pat Cummins','Henrich Klassen','Abishek Sharma',
                             'Nithish Kumar','Bhuvaneshwar Kumar','Travis Head'],
                     'Country':['Aus','NZ','Ind','Ind','SA','Aus','SA','Ind','Ind','Ind','Aus']})
data

                  Name Country
0         David Warner     Aus
1      Kane Williamson      NZ
2        Yuvaraj Singh     Ind
3       Shikwar Dhawan     Ind
4       Aiden Markaram      SA
5          Pat Cummins     Aus
6      Henrich Klassen      SA
7       Abishek Sharma     Ind
8        Nithish Kumar     Ind
9   Bhuvaneshwar Kumar     Ind
10         Travis Head     Aus

In [15]:
data = pd.DataFrame([[1,2],[4,5]],columns=['col1','col2'])
data

   col1  col2
0     1     2
1     4     5

# Data Extraction

## Loading Dataset

### read_csv()
### read_excel()
### read_json()
### read_sql()
### read_html()

In [18]:
"""
    syntax:-
    pd.read_csv(filepath/filename) --> returns data frame
"""

data = pd.read_csv('StudentsPerformance.csv')
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## dataframe.info()

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

## dataframe.shape

### shape is variable not method

In [30]:
print(data.shape)

(1000, 8)

## columns

### it is also variable not method

In [29]:
print(data.columns)

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

## dtypes

### it is also variable not method

In [28]:
print(data.dtypes)

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [ ]:
## need to print only object types

## dataframe.head()

In [32]:
data.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

## dataframe.tail()

### default 5

In [34]:
data.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## dataframe.describe()

### by default it gives summary for numerical values by default

In [38]:
data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [39]:
data.describe(include='all')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.00000,1000.000000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,518,319,226,645,642,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,66.08900,69.169000,68.054000
std,NaN,NaN,NaN,NaN,NaN,15.16308,14.600192,15.195657
min,NaN,NaN,NaN,NaN,NaN,0.00000,17.000000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,57.00000,59.000000,57.750000
50%,NaN,NaN,NaN,NaN,NaN,66.00000,70.000000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,77.00000,79.000000,79.000000
max,NaN,NaN,NaN,NaN,NaN,100.00000,100.000000,100.000000